#### Terraform Initialization `success`
#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

terraform
data.sops_file.secrets: Reading...
data.sops_file.secrets: Read complete after 0s [id=-]
data.azuread_user.admin: Reading...
data.azuread_user.e2e_nonadmin_user: Reading...
data.azuread_application_published_app_ids.well_known: Reading...
data.azuread_user.e2e_admin: Reading...
data.azuread_client_config.current: Reading...
data.azuread_application_published_app_ids.well_known: Read complete after 0s [id=appIds]
data.azuread_client_config.current: Read complete after 0s [id=53174009-29d5-4c20-8bd0-0e2b2b0de6a8-1e4ad037-574d-4fba-a5c3-ed6c85fda2f5-4a8185bf-54b9-4d21-a286-fb744d13c64d]
azuread_service_principal.msgraph: Refreshing state... [id=2bc0e2df-4abf-4297-a53b-4e304da70187]
data.azuread_user.admin: Read complete after 1s [id=74953878-8eaf-421b-b557-b2485367566c]
azuread_group.users: Refreshing state... [id=aac23af7-2d73-497f-b93c-b8ca4007638d]
azuread_group.administrators: Refreshing state... [id=64d004bd-9218-4fae-9919-0505ff5eeb8e]
data.azuread_user.e2e_admin: Read complete after 1s [id=9b910c80-61bc-4df7-bf4b-77cb05ba057c]
data.azuread_user.e2e_nonadmin_user: Read complete after 1s [id=bf9b149f-8a2e-4c4e-bd9b-cfe690aa3c40]
azuread_group_member.administrators_admin: Refreshing state... [id=64d004bd-9218-4fae-9919-0505ff5eeb8e/member/74953878-8eaf-421b-b557-b2485367566c]
azuread_application.pomerium: Refreshing state... [id=1feb9fee-6af3-49b5-bb3f-2fb68ea03958]
azuread_application.proxmox: Refreshing state... [id=16399057-32a8-4025-bdea-fa59b7022326]
azuread_application.argocd: Refreshing state... [id=a147b6df-cb82-4151-b5c8-189df34d4eec]
azuread_service_principal.argocd: Refreshing state... [id=f95af89e-ff8c-4fd7-972b-6dc6c3cfac00]
azuread_service_principal.proxmox: Refreshing state... [id=5fcd07e3-30e0-430f-9ada-7c4e1ca53534]
azuread_service_principal.pomerium: Refreshing state... [id=14c0e26a-2834-4be3-97f6-5b82483ecae3]
azuread_service_principal_delegated_permission_grant.argocd: Refreshing state... [id=nvha-Yz_10-XK23Gw8-sAN_iwCu_SpdCpTtOME2nAYc]
azuread_app_role_assignment.argocd_administrators: Refreshing state... [id=f95af89e-ff8c-4fd7-972b-6dc6c3cfac00/appRoleAssignment/vQTQZBiSrk-ZGQUF_17rjjgwW2WTTslIpqHUh8QCk1k]
azuread_group_member.users_administrators: Refreshing state... [id=64d004bd-9218-4fae-9919-0505ff5eeb8e/member/64d004bd-9218-4fae-9919-0505ff5eeb8e]
azuread_app_role_assignment.pomerium_administrators: Refreshing state... [id=14c0e26a-2834-4be3-97f6-5b82483ecae3/appRoleAssignment/vQTQZBiSrk-ZGQUF_17rjpYG2T6FzfBCjNOFGI1AQSA]
azuread_service_principal_delegated_permission_grant.pomerium: Refreshing state... [id=auLAFDQo40uX9luCSD7K49_iwCu_SpdCpTtOME2nAYc]
azuread_service_principal_delegated_permission_grant.proxmox: Refreshing state... [id=4wfNX-AwD0Oa2nxOHKU1NN_iwCu_SpdCpTtOME2nAYc]
azuread_app_role_assignment.proxmox_administrators: Refreshing state... [id=5fcd07e3-30e0-430f-9ada-7c4e1ca53534/appRoleAssignment/vQTQZBiSrk-ZGQUF_17rjmWSR3LfvShGqeT89TcYmzg]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azuread_app_role_assignment.cloudflare_administrators will be created
  + resource "azuread_app_role_assignment" "cloudflare_administrators" {
      + app_role_id            = "00000000-0000-0000-0000-000000000000"
      + id                     = (known after apply)
      + principal_display_name = (known after apply)
      + principal_object_id    = "64d004bd-9218-4fae-9919-0505ff5eeb8e"
      + principal_type         = (known after apply)
      + resource_display_name  = (known after apply)
      + resource_object_id     = (known after apply)
    }

  # azuread_application.cloudflare will be created
  + resource "azuread_application" "cloudflare" {
      + app_role_ids                = (known after apply)
      + application_id              = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "Cloudflare Access"
      + group_membership_claims     = [
          + "ApplicationGroup",
        ]
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + api {
          + requested_access_token_version = 2
        }

      + feature_tags {
          + enterprise = true
          + gallery    = false
        }

      + required_resource_access {
          + resource_app_id = "00000003-0000-0000-c000-000000000000"

          + resource_access {
              + id   = "64a6cdd6-aab1-4aaf-94b8-3cc8405e90d0"
              + type = "Scope"
            }
          + resource_access {
              + id   = "7427e0e9-2fba-42fe-b0c0-848c9e6a8182"
              + type = "Scope"
            }
          + resource_access {
              + id   = "37f7f235-527c-4136-accd-4a02d197296e"
              + type = "Scope"
            }
          + resource_access {
              + id   = "14dad69e-099b-42c9-810b-d002981feec1"
              + type = "Scope"
            }
          + resource_access {
              + id   = "e1fe6dd8-ba31-4d61-89e7-88639da4683d"
              + type = "Scope"
            }
          + resource_access {
              + id   = "06da0dbc-49e2-44d2-8312-53f166ab848a"
              + type = "Scope"
            }
          + resource_access {
              + id   = "bc024368-1153-4739-b217-4326f2e966d0"
              + type = "Scope"
            }
        }

      + web {
          + redirect_uris = (sensitive value)
        }
    }

  # azuread_application_password.cloudflare will be created
  + resource "azuread_application_password" "cloudflare" {
      + application_object_id = (known after apply)
      + display_name          = (known after apply)
      + end_date              = (known after apply)
      + end_date_relative     = "17280h"
      + id                    = (known after apply)
      + key_id                = (known after apply)
      + start_date            = (known after apply)
      + value                 = (sensitive value)
    }

  # azuread_group_member.administrators_e2e_admin will be created
  + resource "azuread_group_member" "administrators_e2e_admin" {
      + group_object_id  = "64d004bd-9218-4fae-9919-0505ff5eeb8e"
      + id               = (known after apply)
      + member_object_id = "9b910c80-61bc-4df7-bf4b-77cb05ba057c"
    }

  # azuread_group_member.users_administrators must be replaced
-/+ resource "azuread_group_member" "users_administrators" {
      ~ group_object_id  = "64d004bd-9218-4fae-9919-0505ff5eeb8e" -> "aac23af7-2d73-497f-b93c-b8ca4007638d" # forces replacement
      ~ id               = "64d004bd-9218-4fae-9919-0505ff5eeb8e/member/64d004bd-9218-4fae-9919-0505ff5eeb8e" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azuread_group_member.users_e2e_nonadmin_user will be created
  + resource "azuread_group_member" "users_e2e_nonadmin_user" {
      + group_object_id  = "aac23af7-2d73-497f-b93c-b8ca4007638d"
      + id               = (known after apply)
      + member_object_id = "bf9b149f-8a2e-4c4e-bd9b-cfe690aa3c40"
    }

  # azuread_service_principal.cloudflare will be created
  + resource "azuread_service_principal" "cloudflare" {
      + account_enabled              = true
      + app_role_assignment_required = false
      + app_role_ids                 = (known after apply)
      + app_roles                    = (known after apply)
      + application_id               = (known after apply)
      + application_tenant_id        = (known after apply)
      + display_name                 = (known after apply)
      + homepage_url                 = (known after apply)
      + id                           = (known after apply)
      + logout_url                   = (known after apply)
      + oauth2_permission_scope_ids  = (known after apply)
      + oauth2_permission_scopes     = (known after apply)
      + object_id                    = (known after apply)
      + owners                       = [
          + "74953878-8eaf-421b-b557-b2485367566c",
        ]
      + redirect_uris                = (known after apply)
      + saml_metadata_url            = (known after apply)
      + service_principal_names      = (known after apply)
      + sign_in_audience             = (known after apply)
      + tags                         = (known after apply)
      + type                         = (known after apply)

      + feature_tags {
          + enterprise = true
        }
    }

  # azuread_service_principal_delegated_permission_grant.cloudflare will be created
  + resource "azuread_service_principal_delegated_permission_grant" "cloudflare" {
      + claim_values                         = [
          + "Directory.Read.All",
          + "GroupMember.Read.All",
          + "User.Read",
          + "email",
          + "offline_access",
          + "openid",
          + "profile",
        ]
      + id                                   = (known after apply)
      + resource_service_principal_object_id = "2bc0e2df-4abf-4297-a53b-4e304da70187"
      + service_principal_object_id          = (known after apply)
    }

  # cloudflare_access_application.apps["Argo CD"] will be created
  + resource "cloudflare_access_application" "apps" {
      + account_id                = (sensitive value)
      + allowed_idps              = (known after apply)
      + app_launcher_visible      = true
      + aud                       = (known after apply)
      + auto_redirect_to_identity = true
      + domain                    = "argocd.homecentr.one"
      + enable_binding_cookie     = false
      + id                        = (known after apply)
      + name                      = "Argo CD"
      + service_auth_401_redirect = false
      + session_duration          = "24h"
      + skip_interstitial         = false
      + type                      = "self_hosted"
      + zone_id                   = (known after apply)
    }

  # cloudflare_access_application.apps["Homepage"] will be created
  + resource "cloudflare_access_application" "apps" {
      + account_id                = (sensitive value)
      + allowed_idps              = (known after apply)
      + app_launcher_visible      = true
      + aud                       = (known after apply)
      + auto_redirect_to_identity = true
      + domain                    = "homepage.homecentr.one"
      + enable_binding_cookie     = false
      + id                        = (known after apply)
      + name                      = "Homepage"
      + service_auth_401_redirect = false
      + session_duration          = "24h"
      + skip_interstitial         = false
      + type                      = "self_hosted"
      + zone_id                   = (known after apply)
    }

  # cloudflare_access_application.apps["Kubernetes dashboard"] will be created
  + resource "cloudflare_access_application" "apps" {
      + account_id                = (sensitive value)
      + allowed_idps              = (known after apply)
      + app_launcher_visible      = true
      + aud                       = (known after apply)
      + auto_redirect_to_identity = true
      + domain                    = "k8s.homecentr.one"
      + enable_binding_cookie     = false
      + id                        = (known after apply)
      + name                      = "Kubernetes dashboard"
      + service_auth_401_redirect = false
      + session_duration          = "24h"
      + skip_interstitial         = false
      + type                      = "self_hosted"
      + zone_id                   = (known after apply)
    }

  # cloudflare_access_application.apps["Login"] will be created
  + resource "cloudflare_access_application" "apps" {
      + account_id                = (sensitive value)
      + allowed_idps              = (known after apply)
      + app_launcher_visible      = true
      + aud                       = (known after apply)
      + auto_redirect_to_identity = true
      + domain                    = "login.homecentr.one"
      + enable_binding_cookie     = false
      + id                        = (known after apply)
      + name                      = "Login"
      + service_auth_401_redirect = false
      + session_duration          = "24h"
      + skip_interstitial         = false
      + type                      = "self_hosted"
      + zone_id                   = (known after apply)
    }

  # cloudflare_access_application.apps["Proxmox VE"] will be created
  + resource "cloudflare_access_application" "apps" {
      + account_id                = (sensitive value)
      + allowed_idps              = (known after apply)
      + app_launcher_visible      = true
      + aud                       = (known after apply)
      + auto_redirect_to_identity = true
      + domain                    = "pve.homecentr.one"
      + enable_binding_cookie     = false
      + id                        = (known after apply)
      + name                      = "Proxmox VE"
      + service_auth_401_redirect = false
      + session_duration          = "24h"
      + skip_interstitial         = false
      + type                      = "self_hosted"
      + zone_id                   = (known after apply)
    }

  # cloudflare_access_application.ssh["pve1"] will be created
  + resource "cloudflare_access_application" "ssh" {
      + account_id                = (sensitive value)
      + allowed_idps              = (known after apply)
      + app_launcher_visible      = true
      + aud                       = (known after apply)
      + auto_redirect_to_identity = true
      + domain                    = "pve1.homecentr.one"
      + enable_binding_cookie     = false
      + id                        = (known after apply)
      + name                      = "SSH / pve1.homecentr.one"
      + service_auth_401_redirect = false
      + session_duration          = "24h"
      + skip_interstitial         = false
      + type                      = "self_hosted"
      + zone_id                   = (known after apply)
    }

  # cloudflare_access_application.ssh["pve2"] will be created
  + resource "cloudflare_access_application" "ssh" {
      + account_id                = (sensitive value)
      + allowed_idps              = (known after apply)
      + app_launcher_visible      = true
      + aud                       = (known after apply)
      + auto_redirect_to_identity = true
      + domain                    = "pve2.homecentr.one"
      + enable_binding_cookie     = false
      + id                        = (known after apply)
      + name                      = "SSH / pve2.homecentr.one"
      + service_auth_401_redirect = false
      + session_duration          = "24h"
      + skip_interstitial         = false
      + type                      = "self_hosted"
      + zone_id                   = (known after apply)
    }

  # cloudflare_access_application.ssh["pve3"] will be created
  + resource "cloudflare_access_application" "ssh" {
      + account_id                = (sensitive value)
      + allowed_idps              = (known after apply)
      + app_launcher_visible      = true
      + aud                       = (known after apply)
      + auto_redirect_to_identity = true
      + domain                    = "pve3.homecentr.one"
      + enable_binding_cookie     = false
      + id                        = (known after apply)
      + name                      = "SSH / pve3.homecentr.one"
      + service_auth_401_redirect = false
      + session_duration          = "24h"
      + skip_interstitial         = false
      + type                      = "self_hosted"
      + zone_id                   = (known after apply)
    }

  # cloudflare_access_identity_provider.azuread will be created
  + resource "cloudflare_access_identity_provider" "azuread" {
      + account_id = (sensitive value)
      + id         = (known after apply)
      + name       = "Azure AD"
      + type       = "azureAD"

      + config {
          + attributes     = (known after apply)
          + claims         = (known after apply)
          + client_id      = (known after apply)
          + client_secret  = (sensitive value)
          + directory_id   = "53174009-29d5-4c20-8bd0-0e2b2b0de6a8"
          + pkce_enabled   = true
          + redirect_url   = (known after apply)
          + scopes         = (known after apply)
          + support_groups = true
        }
    }

  # cloudflare_access_policy.apps_administrators["Argo CD"] will be created
  + resource "cloudflare_access_policy" "apps_administrators" {
      + account_id     = (sensitive value)
      + application_id = (known after apply)
      + decision       = "allow"
      + id             = (known after apply)
      + name           = "AD Group / Administrators"
      + precedence     = 1
      + zone_id        = (known after apply)

      + include {
          + azure {
              + id                   = [
                  + "64d004bd-9218-4fae-9919-0505ff5eeb8e",
                ]
              + identity_provider_id = (known after apply)
            }
        }
    }

  # cloudflare_access_policy.apps_administrators["Homepage"] will be created
  + resource "cloudflare_access_policy" "apps_administrators" {
      + account_id     = (sensitive value)
      + application_id = (known after apply)
      + decision       = "allow"
      + id             = (known after apply)
      + name           = "AD Group / Administrators"
      + precedence     = 1
      + zone_id        = (known after apply)

      + include {
          + azure {
              + id                   = [
                  + "64d004bd-9218-4fae-9919-0505ff5eeb8e",
                ]
              + identity_provider_id = (known after apply)
            }
        }
    }

  # cloudflare_access_policy.apps_administrators["Kubernetes dashboard"] will be created
  + resource "cloudflare_access_policy" "apps_administrators" {
      + account_id     = (sensitive value)
      + application_id = (known after apply)
      + decision       = "allow"
      + id             = (known after apply)
      + name           = "AD Group / Administrators"
      + precedence     = 1
      + zone_id        = (known after apply)

      + include {
          + azure {
              + id                   = [
                  + "64d004bd-9218-4fae-9919-0505ff5eeb8e",
                ]
              + identity_provider_id = (known after apply)
            }
        }
    }

  # cloudflare_access_policy.apps_administrators["Login"] will be created
  + resource "cloudflare_access_policy" "apps_administrators" {
      + account_id     = (sensitive value)
      + application_id = (known after apply)
      + decision       = "allow"
      + id             = (known after apply)
      + name           = "AD Group / Administrators"
      + precedence     = 1
      + zone_id        = (known after apply)

      + include {
          + azure {
              + id                   = [
                  + "64d004bd-9218-4fae-9919-0505ff5eeb8e",
                ]
              + identity_provider_id = (known after apply)
            }
        }
    }

  # cloudflare_access_policy.apps_administrators["Proxmox VE"] will be created
  + resource "cloudflare_access_policy" "apps_administrators" {
      + account_id     = (sensitive value)
      + application_id = (known after apply)
      + decision       = "allow"
      + id             = (known after apply)
      + name           = "AD Group / Administrators"
      + precedence     = 1
      + zone_id        = (known after apply)

      + include {
          + azure {
              + id                   = [
                  + "64d004bd-9218-4fae-9919-0505ff5eeb8e",
                ]
              + identity_provider_id = (known after apply)
            }
        }
    }

  # cloudflare_access_policy.apps_users["Homepage"] will be created
  + resource "cloudflare_access_policy" "apps_users" {
      + account_id     = (sensitive value)
      + application_id = (known after apply)
      + decision       = "allow"
      + id             = (known after apply)
      + name           = "AD Group / Users"
      + precedence     = 2
      + zone_id        = (known after apply)

      + include {
          + azure {
              + id                   = [
                  + "aac23af7-2d73-497f-b93c-b8ca4007638d",
                ]
              + identity_provider_id = (known after apply)
            }
        }
    }

  # cloudflare_access_policy.apps_users["Login"] will be created
  + resource "cloudflare_access_policy" "apps_users" {
      + account_id     = (sensitive value)
      + application_id = (known after apply)
      + decision       = "allow"
      + id             = (known after apply)
      + name           = "AD Group / Users"
      + precedence     = 2
      + zone_id        = (known after apply)

      + include {
          + azure {
              + id                   = [
                  + "aac23af7-2d73-497f-b93c-b8ca4007638d",
                ]
              + identity_provider_id = (known after apply)
            }
        }
    }

  # cloudflare_access_policy.ssh["pve1"] will be created
  + resource "cloudflare_access_policy" "ssh" {
      + account_id     = (sensitive value)
      + application_id = (known after apply)
      + decision       = "allow"
      + id             = (known after apply)
      + name           = "AD Group / Administrators"
      + precedence     = 1
      + zone_id        = (known after apply)

      + include {
          + azure {
              + id                   = [
                  + "64d004bd-9218-4fae-9919-0505ff5eeb8e",
                ]
              + identity_provider_id = (known after apply)
            }
        }
    }

  # cloudflare_access_policy.ssh["pve2"] will be created
  + resource "cloudflare_access_policy" "ssh" {
      + account_id     = (sensitive value)
      + application_id = (known after apply)
      + decision       = "allow"
      + id             = (known after apply)
      + name           = "AD Group / Administrators"
      + precedence     = 1
      + zone_id        = (known after apply)

      + include {
          + azure {
              + id                   = [
                  + "64d004bd-9218-4fae-9919-0505ff5eeb8e",
                ]
              + identity_provider_id = (known after apply)
            }
        }
    }

  # cloudflare_access_policy.ssh["pve3"] will be created
  + resource "cloudflare_access_policy" "ssh" {
      + account_id     = (sensitive value)
      + application_id = (known after apply)
      + decision       = "allow"
      + id             = (known after apply)
      + name           = "AD Group / Administrators"
      + precedence     = 1
      + zone_id        = (known after apply)

      + include {
          + azure {
              + id                   = [
                  + "64d004bd-9218-4fae-9919-0505ff5eeb8e",
                ]
              + identity_provider_id = (known after apply)
            }
        }
    }

  # cloudflare_record.apps["Argo CD"] will be created
  + resource "cloudflare_record" "apps" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "argocd.homecentr.one"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.apps["Homepage"] will be created
  + resource "cloudflare_record" "apps" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "homepage.homecentr.one"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.apps["Kubernetes dashboard"] will be created
  + resource "cloudflare_record" "apps" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "k8s.homecentr.one"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.apps["Login"] will be created
  + resource "cloudflare_record" "apps" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "login.homecentr.one"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.apps["Proxmox VE"] will be created
  + resource "cloudflare_record" "apps" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "pve.homecentr.one"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.ssh["pve1"] will be created
  + resource "cloudflare_record" "ssh" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "pve1.homecentr.one"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.ssh["pve2"] will be created
  + resource "cloudflare_record" "ssh" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "pve2.homecentr.one"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.ssh["pve3"] will be created
  + resource "cloudflare_record" "ssh" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "pve3.homecentr.one"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = (sensitive value)
    }

  # cloudflare_tunnel.kubernetes will be created
  + resource "cloudflare_tunnel" "kubernetes" {
      + account_id   = (sensitive value)
      + cname        = (known after apply)
      + id           = (known after apply)
      + name         = "Kubernetes"
      + secret       = (sensitive value)
      + tunnel_token = (sensitive value)
    }

Plan: 36 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @lholota, Action: `pull_request`*